Revit 2027 API
ITransactionFinalizer Interface
 An interface that may be used to perform a custom action at the end of a transaction. A method of the interface will be called when a transaction is either committed or rolled back.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface ITransactionFinalizer
Public Interface ITransactionFinalizer
public interface class ITransactionFinalizer
type ITransactionFinalizer = interface end
The ITransactionFinalizer type exposes the following members.
Methods
Name | Description
OnCommitted |  This method is called at the end of committing a transaction
OnRolledBack |  This method is called at the end of rolling back a transaction
Top
See Also
Reference
Autodesk.Revit.DB Namespace